app/controllers/locations_controller.rb

  def index
    if params[:search].present?
      @locations = Location.near(params[:search], 25, :order => :distance)
      @json = Location.near(params[:search], 25, :order => :distance).to_gmaps4rails do |location, marker|
        marker.json({ :id => location.id, :address => location.address })
        if location.address != params[:search] then
          marker.picture({
              :picture => "/assets/star2.png",
              :width   => "30",
              :height  => "30"
            })
        end
      end

      @loc = Location.find_by_address(params[:search])

      @circles = '[
                          {"lng": '+@loc.longitude.to_s+', "lat": '+@loc.latitude.to_s+', "radius": 40234},
                 ]' unless @loc.nil?
    else
      @locations = Location.all
---
SELECT *, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((34.0516004 - latitude) * PI() / 180 / 2), 2) + COS(34.0516004 * PI() / 180) * COS(latitude * PI() / 180) * POWER(SIN((-84.184623 - longitude) * PI() / 180 / 2), 2) )) AS distance, CAST(DEGREES(ATAN2( RADIANS(longitude - -84.184623), RADIANS(latitude - 34.0516004))) + 360 AS decimal) % 360 AS bearing FROM "locations" WHERE (latitude BETWEEN 33.6897709422229 AND 34.4134298577771 AND longitude BETWEEN -84.6213336476996 AND -83.7479123523004) GROUP BY locations.id,locations.address,locations.latitude,locations.longitude,locations.gmaps,locations.created_at,locations.updated_at,locations.user_id,locations.event_id HAVING 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((34.0516004 - latitude) * PI() / 180 / 2), 2) + COS(34.0516004 * PI() / 180) * COS(latitude * PI() / 180) * POWER(SIN((-84.184623 - longitude) * PI() / 180 / 2), 2) )) <= 25 ORDER BY distance
SELECT "locations".* FROM "locations"

  def show
    @location = Location.find(params[:id])
---
SELECT *, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((34.05039 - latitude) * PI() / 180 / 2), 2) + COS(34.05039 * PI() / 180) * COS(latitude * PI() / 180) * POWER(SIN((-84.186204 - longitude) * PI() / 180 / 2), 2) )) AS distance, CAST(DEGREES(ATAN2( RADIANS(longitude - -84.186204), RADIANS(latitude - 34.05039))) + 360 AS decimal) % 360 AS bearing FROM "locations" WHERE (latitude BETWEEN 33.7609264337783 AND 34.3398535662217 AND longitude BETWEEN -84.5355675303729 AND -83.8368404696271 AND locations.id != 26) GROUP BY locations.id,locations.address,locations.latitude,locations.longitude,locations.gmaps,locations.created_at,locations.updated_at HAVING 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((34.05039 - latitude) * PI() / 180 / 2), 2) + COS(34.05039 * PI() / 180) * COS(latitude * PI() / 180) * POWER(SIN((-84.186204 - longitude) * PI() / 180 / 2), 2) )) <= 20 ORDER BY 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((34.05039 - latitude) * PI() / 180 / 2), 2) + COS(34.05039 * PI() / 180) * COS(latitude * PI() / 180) * POWER(SIN((-84.186204 - longitude) * PI() / 180 / 2), 2) )) ASC

  def create

    @location = Location.new(params[:location])
    if @location.save
---
INSERT INTO "locations" ("address", "created_at", "gmaps", "latitude", "longitude", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"