app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (email = 'rajkishan.m@gmail.com' AND password = 'vegpuf')
---
  def sign_in
    @user_name = params[:user][:email]
    @password = params[:user][:password]

    @user = User.where("email = ? AND password = ?", @user_name, @password)

INSERT INTO "users" ("blank_field_1", "blank_field_2", "blank_field_3", "blank_field_4", "blank_field_5", "category", "city", "created_at", "email", "first_name", "fu_city", "fu_from", "fu_state", "fu_street_direction", "fu_street_name", "fu_street_number", "fu_to", "fu_zipcode_1", "game", "last_name", "middle_name", "password", "phone", "role", "skill_level", "specialization", "state", "street_direction", "street_name", "street_number", "updated_at", "zipcode_1", "zipcode_2") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33) RETURNING "id"
INSERT INTO "locations" ("address", "created_at", "event_id", "gmaps", "latitude", "longitude", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(params[:user])




    respond_to do |format|
      if @user.save

        user = @user
        user_address = user.street_number.to_s+' '+ user.street_name.to_s + ' '+ user.city.to_s + ' ' + user.state.to_s
        h = Hash.new
        h['address'] = user_address
        h['gmaps'] = true
        @loc = Location.new(h)
        @loc.save